package main

var CityToProvinces = []map[string]string{
	//"北京":   "北京市",
	{"泉州": "福建"},
	{"福州": "福建"},
	{"漳州": "福建"},
	{"厦门": "福建"},

	{"太原*": "山西"},
	{"太原": "山西"},
	{"大同": "山西"},

	{"武汉": "湖北"},
	{"宜昌": "湖北"},
	{"孝感": "湖北"},
	{"荆州": "湖北"},

	{"济南": "山东"},
	{"泰安": "山东"},

	{"广州": "广东"},
	{"珠海": "广东"},

	{"天津": "天津"},

	{"呼和浩特": "呼和浩特"},

	{"包头": "包头"},

	{"沈阳": "沈阳"},

	{"上海": "上海"},

	{"昆明": "昆明"},

	{"长沙": "长沙"},

	{"重庆": "重庆"},

	{"哈尔滨": "哈尔滨"},

	{"南昌": "南昌"},

	{"保定": "保定"},

	{"吴忠": "吴忠"},

	{"银川": "银川"},

	//"泾阳":   "陕西省",
	{"西宁": "西宁"},

	{"昆明*": "昆明*"},
}

func main() {
	list := CityToProvinces
	for i, v := range list {
		println("第", i, "个数据:")
		for k, v1 := range v {
			println("key:", k)
			println("value:", v1)
		}
	}

}
